{"hexproof": "This creature can't be the target of spells or abilities your opponents control.", "battle cry": "Whenever this creature attacks, each other attacking creature gets +1/+0 until end of turn.", "fortify": "Attach to target land you control. Fortify only as a sorcery. This card enters the battlefield unattached and stays on the battlefield if the land leaves.", "equip": "Cost: Attach to target creature you control. Equip only as a sorcery.", "fear": "This creature can't be blocked except by artifact creatures and/or black creatures.", "lifelink": "Damage dealt by this creature also causes its controller to gain that much life.", "flash": "You may cast this spell any time you could cast an instant.", "affinity": "This spell costs 1 less to cast for each artifact you control.", "persist": "When this creature dies, if it had no -1/-1 counters on it, return it to the battlefield under its owner's control with a -1/-1 counter on it.", "exalted": "Whenever a creature you control attacks alone, that creature gets +1/+1 until end of turn.", "rebound": "Exile the spell as it resolves if you cast it from your hand. At the beginning of your next upkeep, you may cast that card from exile without paying its mana cost.", "convoke": "Each creature you tap while casting this spell reduces its cost by or by one mana of that creature's color.", "ninjutsu": "Cost: Return an unblocked attacker you control to hand: Put this card onto the battlefield from your hand tapped and attacking.", "epic": "For the rest of the game, you can't cast spells. At the beginning of each of your upkeeps, copy this spell except for its epic ability.", "split second": "As long as this spell is on the stack, players can't cast spells or activate abilities that aren't mana abilities.", "morph": "You may cast this face down as a 2/2 creature for . Turn it face up any time for its morph cost.", "enchant": "Specifies what these Enchantments can Enchant.", "transmute": "Cost, Discard this card: Search your library for a card with the same converted mana cost as this card, reveal it, and put it into your hand. Then shuffle your library. Transmute only as a sorcery", "level up": "Cost: Put a level counter on this. Level up only as a sorcery.", "changeling": "This card is every creature type at all times. All types can be found in Comprehensive Rule 205.3m.", "reinforce": "Cost, Discard this card: Put a +1/+1 counter on target creature.", "defender": "These creatures can't attack.", "ripple": "When you cast this spell, you may reveal the top four cards of your library. You may cast any revealed cards with the same name as this spell without paying their mana costs. Put the rest on the bottom of your library.", "horsemanship": "This creature can't be blocked except by creatures with horsemanship.", "flashback": "You may cast this card from your graveyard for its flashback cost. Then exile it.", "unearth": "Cost: Return this card from your graveyard to the battlefield. It gains haste. Exile it at the beginning of the next end step or if it would leave the battlefield. Unearth only as a sorcery.", "poisonous": "Whenever it deals combat damage to a player, that player gets poison counters equal to the creature's Poisonous. A player with ten or more poison counters loses the game.", "kicker and multikicker": "You may pay an additional cost as you cast this spell.", "forecast": "Activate this ability only during your upkeep and only once each turn.", "phasing": "This phases in or out before you untap during each of your untap steps. While it's phased out, it's treated as though it doesn't exist.", "entwine": "Choose both if you pay the entwine cost.", "modular": "This creature enters the battlefield with three +1/+1 counters on it. When it dies, you may put its +1/+1 counters on target artifact creature.", "vanishing": "This permanent enters the battlefield with defined number of time counters on it. At the beginning of your upkeep, remove a time counter from it. When the last is removed, sacrifice it.", "protection": "This creature can't be blocked, targeted, dealt damage, or equiped/enchanted by anything of the defined protection.", "splice": "As you cast an Arcane spell, you may reveal this card from your hand and pay its splice cost. If you do, add this card's effects to that spell.", "transfigure": "Cost, Sacrifice this creature: Search your library for a creature card with the same converted mana cost as this creature and put that card onto the battlefield. Then shuffle your library. Transfigure only as a sorcery.", "bushido": "When this creature blocks or becomes blocked, it gets +1/+1 until end of turn.", "devour": "As this enters the battlefield, you may sacrifice any number of creatures. This creature enters the battlefield with that many +1/+1 counters on it.", "evoke": "You may cast this spell for its evoke cost. If you do, it's sacrificed when it enters the battlefield.", "suspend": "Rather than cast this card from your hand, you may pay cost and exile it with three time counters on it. At the beginning of your upkeep, remove a time counter. When the last is removed, cast it without paying its mana cost.", "madness": "If you discard this card, you may cast it for its madness cost instead of putting it into your graveyard.", "echo": "At the beginning of your upkeep, if this came under your control since the beginning of your last upkeep, sacrifice it unless you pay its echo cost.", "annihilator": "Whenever this creature attacks, defending player sacrifices permanents.", "cumulative upkeep": "At the beginning of your upkeep, put an age counter on this permanent, then sacrifice it unless you pay its upkeep cost for each age counter on it.", "cycling": "Cost, Discard this card: Draw a card.", "flying": "This creature can't be blocked except by creatures with flying or reach.", "bloodthirst": "If an opponent was dealt damage this turn, this creature enters the battlefield with a +1/+1 counter on it.", "replicate": "When you cast it, copy it for each time you paid its replicate cost. You may choose new targets for the copies.", "storm": "When you cast this spell, copy it for each spell cast before it this turn. You may choose new targets for the copies.", "sunburst": "This enters the battlefield with a +1/+1 counter(s) or charge counter(s) on it for each color of mana spent to cast it.", "champion": "When this enters the battlefield, sacrifice it unless you exile another creature of the same type you control. When this leaves the battlefield, that card returns to the battlefield.", "offering": "You may cast this card any time you could cast an instant by sacrificing a defined creature and paying the difference in mana costs between this and the sacrificed creature's Mana cost including color.", "infect": "This creature deals damage to creatures in the form of -1/-1 counters and to players in the form of poison counters.", "deathtouch": "Any amount of damage this deals to a creature is enough to destroy it.", "haunt": "When this creature dies, exile it haunting target creature.", "shroud": "This Permenant or Player can't be the target of spells or abilities.", "frenzy": "Whenever a Sliver attacks and isn't blocked, it gets +the Frenzy amount/+0 until end of turn.", "amplify": "As this creature enters the battlefield, put a +1/+1 counter on it for each creature of the same type you reveal in your hand.", "rampage": "Whenever this creature becomes blocked, it gets +Defined Number/+Defined Number until end of turn for each creature blocking it beyond the first.", "dredge": "If you would draw a card, instead you may put the Dredge number of cards from the top of your library into your graveyard. If you do, return this card from your graveyard to your hand. Otherwise, draw a card.", "intimidate": "This creature can't be blocked except by artifact creatures and/or creatures that share a color with it.", "prowl": "You may cast this for its prowl cost if you dealt combat damage to a player this turn with a creature type of the same type.", "double strike": "It deals both first-strike and regular combat damage.", "living weapon": "When this Equipment enters the battlefield, put a 0/0 black Germ creature token onto the battlefield, then attach this to it.", "gravestorm": "When you cast this spell, copy it for each permanent put into a graveyard this turn. You may choose new targets for the copies.", "conspire": "As you cast this spell, you may tap two untapped creatures you control that share a color with it. When you do, copy it and you may choose a new target for the copy.", "soulshift": "When this creature dies, you may return target Spirit card with a defined converted mana cost or less from your graveyard to your hand.", "provoke": "When this attacks, you may have target creature defending player controls untap and block it if able.", "fading": "This creature enters the battlefield with a number of fade counters on it. At the beginning of your upkeep, remove a fade counter from it. If you can't, sacrifice it.", "graft": "This creature enters the battlefield with two +1/+1 counters on it. Whenever another creature enters the battlefield, you may move a +1/+1 counter from this creature onto it.", "recover": "When a creature is put into your graveyard from the battlefield, you may pay cost. If you do, return this card from your graveyard to your hand. Otherwise, exile this card.", "banding": "Any creatures with banding, and up to one without, can attack in a band. Bands are blocked as a group. If any creatures with banding you control are blocking or being blocked by a creature, you divide that creature's combat damage, not its controller, among any of the creatures it's being blocked by or is blocking.", "retrace": "You may cast this card from your graveyard by discarding a land card in addition to paying its other costs.", "totem armor": "If enchanted creature would be destroyed, instead remove all damage from it and destroy this Aura.", "trample": "If this creature would assign enough damage to its blockers to destroy them, you may have it assign the rest of its damage to defending player or planeswalker.", "wither": "This deals damage to creatures in the form of -1/-1 counters.", "vigilance": "Attacking doesn't cause this creature to tap.", "flanking": "Whenever a creature without flanking blocks this creature, the blocking creature gets -1/-1 until end of turn.", "hideaway": "This land enters the battlefield tapped. When it does, look at the top four cards of your library, exile one face down, then put the rest on the bottom of your library.", "absorb": "If a source would deal damage to this creature, prevent the Absorb amount of that damage.", "reach": "This creature can block creatures with flying.", "buyback": "You may pay an additional cost as you cast this spell. If you do, put this card into your hand as it resolves.", "aura swap": "Exchange this Aura with an Aura card in your hand.", "delve": "You may exile any number of cards from your graveyard as you cast this spell. It costs 1 less to cast for each card exiled this way.", "first strike": "This creature deals combat damage before creatures without first strike.", "landwalk": "This creature is unblockable as long as defending player controls a land of the defined type.", "cascade": "When you cast this spell, exile cards from the top of your library until you exile a nonland card that costs less. You may cast it without paying its mana cost. Put the exiled cards on the bottom in a random order.", "haste": "This creature can attack and tap this turn."}